import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import { RouterModule } from '@angular/router';
import { PagesHeaderComponent } from '../../../shared/components/pages-header/pages-header.component';

@Component({
  selector: 'app-about-us',
  standalone: true,
  imports: [CommonModule, RouterModule, PagesHeaderComponent],
  templateUrl: './about-us.component.html',
  styleUrl: './about-us.component.css',
})
export class AboutUsComponent {
  // Page content
  aboutUs = {
    title: 'من نحن',
    generalInfo: {
      title: 'تعريف عام',
      description:
        'سلاح الصيانة فرع من فروع الأسلحة في القوات البرية المملكة السعودية، يعمل على صيانة الأسلحة والمعدات والأجهزة والآليات، والمحافظة على جاهزيتها لتعمل في مختلف الأحوال والظروف بكفاءة عالية.',
    },
    history: {
      title: 'خلفية تاريخية',
      paragraphs: [
        'وفقاً لنظام المستويات بدءاً من الصيانة الوقائية والصيانة المباشرة ثم العامة إلى مستوى القواعد الرئيسية، وتعتبر أول نواة لسلاح الصيانة كانت في عهد الملك عبد العزيز برحمه الله، عبارة عن ورش صغيرة تفي بمتطلبات ذلك الوقت إلى أن تم في عام 1369هـ أحداث تشكيل جديد يرتبط بهيئة الإمدادات وتموين الجيش سمي مساعد هيئة الإمدادات والتموين للصيانة والنقل، وفي عام 1375هـ تم فصل سلاح النقل عن سلاح الصيانة، ولكن بقي سلاح الصيانة بالتزاماته الفنية تجاه أعمال الصيانة والتموين الفني وخاصة تزويد الجيش العربي السعودي بالمعدات والآليات وقطع الغيار وفق أحدث الأساليب فقد تم في عام 1382هـ. الموافق 1963م وضع برنامج لإدارة آليات الجيش بالاستفادة من خبرات سلاح المهندسين الأمريكي، وتم توقيع اتفاقية لتنظيم أعمال صيانة الأسلحة والعربات والآليات والتموين بقطع الغيار.',
        'ويعد سلاح الصيانة أول من استخدم الحاسب الآلي في المملكة العربية السعودية لصالح القوات البرية في عام 1386هـ. الموافق 1966م لإدارة أعمال التموين الفني آلياً للتقيد بالمواصفات القياسية وتسريع الأعمال الإدارية، ويذكر بذلك أول من أدخل هذا النظام بعد شركة أرامكو السعودية وزارة المالية، وفي شهر يوليو من عام 1968م الموافق1388هـ شهد جلالة الملك فيصل تركيب حاسب آلي من نوع (آي بي إم 360) في قسم التموين، وتم تحويل العمل إلى النظام الآلي لإدارة مركزياً من قيادة سلاح الصيانة، واقتصر استخدام الحاسب الآلي على أعمال التموين الفني وبعض الأعمال الإدارية بسلاح الصيانة ولخدمة أفرع القوات البرية من ناحية أعمال الصيانة والتموين، وقد أخذ سلاح الصيانة على عاتقة مسؤولية إكمال برنامج آليات الجيش في عام 1392هـ. ويتولى سلاح الصيانة حالياً كافة أعمال الإدارة التموينية لصيانة جميع أسلحة وأجهزة معدات وعربات وآليات القوات البرية لتكون صالحة لعمل في كل الأحوال والظروف، كما أخذ على عاتقة بناء وتأهيل الكوادر الفنية من ضباط وأفراد وموظفين.',
      ],
    },
  };
}
